log

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:los="http://www.vpbank.com.vn/LOSOut">
    <soapenv:Header/>
    <soapenv:Body>
        <rain1:RequestPayload xmlns:rain1="http://ap.com/xsd/message/iso20022/rain.001.01" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn1="urn:iso:std:iso:20022:tech:xsd:head.001.001.01" xmlns:urn="urn:iso:std:iso:20022:tech:xsd:rain.001.001.01">
            <urn1:AppHdr>
                <urn1:Fr>
                    <urn1:OrgId>
                        <urn1:Id>
                            <urn1:OrgId>
                                <urn1:Othr>
                                    <urn1:Id>010035</urn1:Id>
                                </urn1:Othr>
                            </urn1:OrgId>
                        </urn1:Id>
                    </urn1:OrgId>
                </urn1:Fr>
                <urn1:To>
                    <urn1:OrgId>
                        <urn1:Id>
                            <urn1:OrgId>
                                <urn1:Othr>
                                    <urn1:Id>ZAPP</urn1:Id>
                                </urn1:Othr>
                            </urn1:OrgId>
                        </urn1:Id>
                    </urn1:OrgId>
                </urn1:To>
                <urn1:BizMsgIdr>AUTQ</urn1:BizMsgIdr>
                <urn1:MsgDefIdr>rain.001.001.01</urn1:MsgDefIdr>
                <urn1:BizSvc>RTLFromCFI</urn1:BizSvc>
                <urn1:CreDt>2020-03-30T14:20:14Z</urn1:CreDt>
                <urn1:Sgntr>
                    <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
                        <SignedInfo>
                            <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
                            <SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256" />
                            <Reference URI="">
                                <Transforms>
                                    <Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" />
                                    <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
                                </Transforms>
                                <DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256" />
                                <DigestValue>VZqAzvhP9aakkpPOChtLKYY8vzThMqN8XWWCEnVaMpc=</DigestValue>
                            </Reference>
                            <Reference>
                                <Transforms>
                                    <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
                                </Transforms>
                                <DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256" />
                                <DigestValue>Jl+dZnV/k1u+HvPiTES93+Omb8Fa95f0wY7NcJmHzC0=</DigestValue>
                            </Reference>
                            <Reference URI="#ide2dfde4a-c3dd-4f16-b47a-468ab386f649">
                                <Transforms>
                                    <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
                                </Transforms>
                                <DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256" />
                                <DigestValue>Jw+rRmeLJnsvh9AMdOiF2UTVIaAdu1tDt+8evxWJMbU=</DigestValue>
                            </Reference>
                        </SignedInfo>
                        <SignatureValue>XzCZnYNR8kS0Gmb8913EcLUwT++czaFOKhWBBSLEHB3qzAu7w8FRJZKCugfRildCnnFCTcDvX5s0UDE5pHNySxjcLNGhkKVKl0hqc89FvZN1q5e3Dgz8n96qTcciddmxdqDeyfIVM1zhRJTBEzJ6PNTnJcIg5gXPjd3hVQF6lUN14F2gsLZoVo9e+DS3T0M/7XBSMaiYTKAzIDFbbaYhFQY8uC11yeZwp7RGXQJt4opLcJVHpqfSCI9lnBn4JY0fY527PJdqe74Yd6/Za17ez/MPUn2v+fND8iHW2ddmWchq29O3G4Os7CetzqwpatFPvEKjG1w8IXDucJIvUZapaw==</SignatureValue>
                        <KeyInfo Id="ide2dfde4a-c3dd-4f16-b47a-468ab386f649">
                            <X509Data>
                                <X509SKI>h02uts6X9fT4Qs8ISgePLgCwAIg=</X509SKI>
                            </X509Data>
                        </KeyInfo>
                    </Signature>
                </urn1:Sgntr>
            </urn1:AppHdr>
            <urn:Document>
                <urn:PrsntInitn>
                    <urn:Hdr>
                        <urn:MsgFctn>LINK</urn:MsgFctn>
                        <urn:PrtcolVrsn>001</urn:PrtcolVrsn>
                        <urn:XchgId>001</urn:XchgId>
                        <urn:CreDtTm>2020-03-30T14:20:14Z</urn:CreDtTm>
                        <urn:InitgPty>
                            <urn:Id>010035</urn:Id>
                            <urn:Tp>FINI</urn:Tp>
                        </urn:InitgPty>
                        <urn:RcptPty>
                            <urn:Id>ZAPP</urn:Id>
                            <urn:Tp>SCHM</urn:Tp>
                        </urn:RcptPty>
                        <urn:Tracblt>
                            <urn:RlayId>
                                <urn:Id>50C3GRVL3</urn:Id>
                                <urn:Tp>FINI</urn:Tp>
                            </urn:RlayId>
                        </urn:Tracblt>
                    </urn:Hdr>
                    <urn:PrsntmntReq>
                        <urn:Envt>
                            <urn:Acqrr>
                                <urn:Id>
                                    <urn:Id>000666</urn:Id>
                                    <urn:Tp>DSTR</urn:Tp>
                                </urn:Id>
                            </urn:Acqrr>
                            <urn:Mrchnt>
                                <urn:Id>
                                    <urn:Id>MERCHANT000050</urn:Id>
                                    <urn:Tp>MERC</urn:Tp>
                                    <urn:Issr>DSTR</urn:Issr>
                                </urn:Id>
                                <urn:CmonNm>Iceland</urn:CmonNm>
                            </urn:Mrchnt>
                            <urn:CstmrFinInst>
                                <urn:Id>
                                    <urn:Othr>
                                        <urn:Id>101016</urn:Id>
                                        <urn:IdTp>IICA</urn:IdTp>
                                    </urn:Othr>
                                </urn:Id>
                            </urn:CstmrFinInst>
                            <urn:Customer>
                                <urn:Id>
                                    <urn:CstmrNb>4783746</urn:CstmrNb>
                                    <urn:EmailAdr>rajat.malik@fisglobal.com</urn:EmailAdr>
                                    <urn:Othr>
                                        <urn:Id>customerid</urn:Id>
                                        <urn:IdTp>LNKA</urn:IdTp>
                                    </urn:Othr>
                                </urn:Id>
                                <urn:Nm>
                                    <urn:NmPrfx>
                                        <urn:Cd>DOCT</urn:Cd>
                                    </urn:NmPrfx>
                                    <urn:GvnNm>John</urn:GvnNm>
                                    <urn:MddlNm>Allenji</urn:MddlNm>
                                    <urn:LstNm>Allen</urn:LstNm>
                                </urn:Nm>
                                <urn:BllgAdr>
                                    <urn:FIRegd>true</urn:FIRegd>
                                    <urn:AdrLine>434324</urn:AdrLine>
                                    <urn:AdrLine>dfzfdfdffgfg</urn:AdrLine>
                                </urn:BllgAdr>
                                <urn:Prfrnc>
                                    <urn:PayAdvReq>true</urn:PayAdvReq>
                                    <urn:MxAutoAuthLmt>36</urn:MxAutoAuthLmt>
                                    <urn:AmntPref>
                                        <urn:AmntTp>AMTN</urn:AmntTp>
                                        <urn:SetAmnt Ccy="USD">50</urn:SetAmnt>
                                    </urn:AmntPref>
                                    <urn:DtPref>
                                        <urn:Pymntdt>
                                            <urn:DtTp>DUED</urn:DtTp>
                                            <urn:DayofMnth>4</urn:DayofMnth>
                                        </urn:Pymntdt>
                                    </urn:DtPref>
                                    <urn:LnkngPref>
                                        <urn:IsPrxyLnk>0</urn:IsPrxyLnk>
                                        <urn:AcctIdrTp>IBAN</urn:AcctIdrTp>
                                        <urn:LnkAccntRef>ref</urn:LnkAccntRef>
                                    </urn:LnkngPref>
                                </urn:Prfrnc>
                            </urn:Customer>
                            <urn:Invcee>
                                <urn:PtyId>
                                    <urn:Id>
                                        <urn:PrvtId>
                                            <urn:BllgactId>Z5Z7SX1AA8D8UTD92FIEHSHQDJLDDD</urn:BllgactId>
                                        </urn:PrvtId>
                                    </urn:Id>
                                </urn:PtyId>
                                <urn:Nm>
                                    <urn:GvnNm>GName922777</urn:GvnNm>
                                    <urn:MddlNm>MName922777</urn:MddlNm>
                                    <urn:LstNm>LName922777</urn:LstNm>
                                </urn:Nm>
                                <urn:PtyAuthParams>
                                    <urn:CtgryCd>EMAL</urn:CtgryCd>
                                    <urn:CtgryLbl>email</urn:CtgryLbl>
                                    <urn:CtgryVal>mahendra.kishore@vocalink.com</urn:CtgryVal>
                                </urn:PtyAuthParams>
                            </urn:Invcee>
                        </urn:Envt>
                        <urn:Tx>
                            <urn:TxTp>
                                <urn:Tp>RGST</urn:Tp>
                                <urn:AddnlTxTp>NTRQ</urn:AddnlTxTp>
                            </urn:TxTp>
                            <urn:PdctTp>
                                <urn:Tp>BPX</urn:Tp>
                                <urn:AddnlPdctTp>NTRQ</urn:AddnlPdctTp>
                            </urn:PdctTp>
                            <urn:ChckoutTp>NTRQ</urn:ChckoutTp>
                            <urn:TxId>
                                <urn:TxDtTm>2020-03-30T14:20:14Z</urn:TxDtTm>
                                <urn:InitrTxId>GP12984532145388</urn:InitrTxId>
                            </urn:TxId>
                            <urn:TxDtls>
                                <urn:TxAmts>
                                    <urn:TtlAmt Ccy="USD">10</urn:TtlAmt>
                                </urn:TxAmts>
                                <urn:BllgDtls>
                                    <urn:BllgactId>Z5Z7SX1AA8D8UTD92FIEHSHQDJL7FU</urn:BllgactId>
                                    <urn:BllgRef>billingReference</urn:BllgRef>
                                </urn:BllgDtls>
                            </urn:TxDtls>
                            <urn:AcctFr>
                                <urn:AcctNm>DSTR</urn:AcctNm>
                                <urn:AcctIdr>
                                    <urn:IsPrxy>0</urn:IsPrxy>
                                    <urn:Tp>IBAN</urn:Tp>
                                    <urn:AcctRef>accreff</urn:AcctRef>
                                    <urn:IBAN>8</urn:IBAN>
                                </urn:AcctIdr>
                            </urn:AcctFr>
                        </urn:Tx>
                    </urn:PrsntmntReq>
                </urn:PrsntInitn>
            </urn:Document>
        </rain1:RequestPayload>
    </soapenv:Body>
</soapenv:Envelope>
